---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitError
source: html/81981017-4676-9e99-dfde-7f8eee0c573a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitError Property

The splitting boundary must split the Surface into exactly two pieces.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceSplitError { get; }
```